In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv(r"D:\tutorials\PROGRAMMING\Statistics For Machine Learning\customer_income_data.csv")
df

,CustomerID,CustomerGender,CustomerAge,CustomerCity,AnnualIncome,CreditScore,SpendingScore,CustomerCityID
0,1001,Male,49,Bengaluru,527547.58850,653,78,1
1,1002,Male,59,Bengaluru,207143.19760,630,63,1
2,1003,Female,54,Delhi,164423.84570,555,69,4
3,1004,Female,42,Bengaluru,56220.36443,699,30,1
4,1005,Female,30,Bengaluru,256194.36190,793,6,1
...,...,...,...,...,...,...,...,...
195,1196,Female,54,Delhi,317466.42070,601,52,4
196,1197,Female,20,Bengaluru,323305.50020,554,58,1
197,1198,Male,44,Chennai,109058.54430,844,36,2
198,1199,Male,28,Delhi,160116.89300,837,24,4
199,1200,Male,41,Chennai,280081.39010,789,31,2

In [5]:
# Check for null values

df.isnull().sum()

CustomerID        0
CustomerGender    0
CustomerAge       0
CustomerCity      0
AnnualIncome      0
CreditScore       0
SpendingScore     0
CustomerCityID    0
dtype: int64

In [10]:
# 5 point number summary 

df[['AnnualIncome','SpendingScore']].describe()

        AnnualIncome  SpendingScore
count     200.000000      200.00000
mean   285143.931646       50.70500
std    169229.187619       28.72269
min      2577.057456        2.00000
25%    153227.340950       27.75000
50%    263418.505550       48.00000
75%    384857.116200       77.00000
max    695407.091700      100.00000

In [7]:
df['AnnualIncome'].var()

28638517942.28571

In [8]:
df['AnnualIncome'].std()

169229.18761929253

In [11]:
df['SpendingScore'].var()

824.9929396984925

In [12]:
df['SpendingScore'].std()

28.722690328353515

In [14]:
from scipy.stats import skew
skew(df['SpendingScore'])   # result is greater than 0, therefore it is positively skewed

0.10081837365183154

In [15]:
from scipy.stats import kurtosis
kurtosis(df['SpendingScore'])

-1.169118698099353

In [ ]:
# DETECTING OUTLERS BASED ON ZSCORE

# Determine ZScore
from scipy.stats import zscore